simulation/sandCastingBase/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    inlet
    {
        type triSurfaceMesh;
        file "inlet.stl";
        name inlet;
    }
    
    riser
    {
        type triSurfaceMesh;
        file "riser.stl";
        name riser;
    }
    
    model
    {
        type triSurfaceMesh;
        file "model.stl";
        name model;
    }
    
    // Define a region to be removed (everything outside your domain of interest)
    outsideDomain
    {
        type    searchableBox;
        min     (-200 -200 -200);  // Make this larger than your domain
        max     (200 200 200);     // Make this larger than your domain
    }
}

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.1;
    nCellsBetweenLevels 3;

    features
    (
        // Feature refinement settings if needed
    );
    
    refinementSurfaces
    {
        inlet
        {
            level (3 4);
        }
        
        riser
        {
            level (3 4);
        }
        
        model
        {
            level (2 3);
        }
    }

    resolveFeatureAngle 30;
    
    // Critical: Place INSIDE your geometry of interest
    locationInMesh (0.007499999832361937 -0.14880019426345825 -0.2297995537519455);  // Adjust to be precisely inside your model
    
    allowFreeStandingZoneFaces false;
    
    refinementRegions
    {
        // Refinement inside the model, creating a cellZone
        model
        {
            mode inside;
            levels ((2 2));
            cellZone fluid;
        }
        
        // Keep outside domain at minimal refinement
        outsideDomain
        {
            mode outside;
            levels ((0 0));
        }
    }
}

snapControls
{
    nSmoothPatch 5;
    tolerance 1.5;
    nSolveIter 50;
    nRelaxIter 10;
    nFeatureSnapIter 15;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 3.5;
    maxInternalSkewness 3.5;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-30;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}

debug 0;
mergeTolerance 1e-6;